EDT/ZUP/zup_edt/src/DataProcessors/НастройкаДоступаКРекрутинговымСайтам/НастройкаДоступаКРекрутинговымСайтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаДоступаКРекрутинговымСайтам</name>
</mdclass:DataProcessor>

EDT/ZUP/zup_edt/src/InformationRegisters/НастройкиИнтеграцииРекрутинговыхСайтов/НастройкиИнтеграцииРекрутинговыхСайтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииРекрутинговыхСайтов</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаркерДоступа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МаркерОбновления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияМаркераДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПроверкиОткликовКандидатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПроверкиКомментариевРезюме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекрутинговыйСайт</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/DataProcessors/НастройкаДоступаКРекрутинговымСайтам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуемыеСайты(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	Результат = Новый Массив;
	НоваяСтруктураОтвета = Новый ФиксированнаяСтруктура(
		"Сайт, ИмяПользователя, Ошибка",
		Справочники.ИсточникиИнформацииОКандидатах.ПустаяСсылка(), "", Ложь);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.РекрутинговыйСайт КАК Сайт,
	|	НастройкиИнтеграцииРекрутинговыхСайтов.ИмяПользователя КАК ИмяПользователя
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов КАК НастройкиИнтеграцииРекрутинговыхСайтов
	|ГДЕ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Пользователь = &ТекущийПользователь
	|	И НастройкиИнтеграцииРекрутинговыхСайтов.Использовать");
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура(НоваяСтруктураОтвета);
			ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
			МаркерДоступаАктивен = ИнтеграцияРекрутинговыхСайтов.МаркерДоступаАктивен(Выборка.Сайт, Выборка.ИмяПользователя);
			Если Не МаркерДоступаАктивен Тогда
				СтруктураОтвета.Ошибка = Истина;
			КонецЕсли;
			Результат.Добавить(СтруктураОтвета);
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецФункции

#КонецОбласти

#КонецЕсли
